const long_description = `
### [경기대학교 SWAIG 홈페이지 제작]

![App Screenshot](project_img/2/8.png)

3학년 여름방학 때, 담당 교수님께서 교내 SWAIG라는 융합전공시스템을 위한 신규 홈페이지가 필요하다고 제작할 것을 주문하셨습니다. 이는 학과 홈페이지가 아닌, 전교생을 대상으로 하는 시스템으로써 새롭게 도입되는 전과 제도에서 중심적으로 사용될 예정이라고 합니다. 

저는 이때까지 기존 프로젝트에서 겪었던 여러 문제들을 해결하고자 하였고, 기존 프로젝트에서 핵심 뼈대를 담당하는 MVC 패턴을 제외한 모든 것을 새롭게 설계했습니다. 이때부터 프로젝트를 public으로 전환하여 누구나 코드를 볼 수 있는 상태로 전환했으며, 기존에 존재하지 않던 반응형 웹을 적용했습니다. 또, Spring의 tiles 라이브러리로부터 영감을 얻은 고정형 레이아웃을 만들어서 기존 프로젝트와 달리 코드량을 대폭 감소시켜 앞으로의 유지보수에도 도움이 될 수 있도록 개선했습니다. 

(현재 이 홈페이지는 아직 융합전공 제도가 시작되지 않은 관계로 2022년 하반기부터 본격적으로 운영을 할 계획으로, 8월부터 데이터 입력 및 홍보에 진행 할 것으로 알려져있습니다.)

`;
export default long_description;