const long_description = `
## ■▮ 컴퓨터공학전공 홈페이지 개발팀 (팀장) ▮■

---

### ■ 개요
##### ◻ 2020년 10월 ~ 2021년 12월
![App Screenshot](project_img/1/1.png)

* 2학년으로 재학 중일 때, 우연한 기회로 학부 홈페이지 관리팀(CS-HOME)을 인수받아 유지보수 및 각종 기능 개발을 주도적으로 진행했습니다.
* 기능 개선 때마다 담당 교수님, 학부장님, 학과사무실 등 주요 사용자에게 알리는 작업도 병행했으며, 기능 개선 요청이 들어오는 경우 차기 업데이트에 참고하여 배포하는 작업을 주로 했습니다.

![App Screenshot](project_img/1/2.png)

![App Screenshot](project_img/1/3.png)


* 2018년 3월, 선배 중 누군가의 학과 홈페이지 개설 이후, 유지보수를 담당할 학생들이 지속적으로 선정됐으나 인수인계의 부재와 복잡한 코드와 환경설정 등 수년간 여러 문제가 누적되어 교수님들께서 프로젝트를 중단을 심각히 고려할 정도로 관리가 되지 않았습니다.
* 하지만 20년도 말에 이 프로젝트를 맡게된 이후, 포기하지 않고 여러 활동을 진행한 것을 계기로 다시 학과 내에 관리인력이 모이기 시작하여 웹 사이트가 정상화됐습니다.

![App Screenshot](project_img/1/4.png)

![App Screenshot](project_img/1/5.png)


### ■ 인공지능전공 홈페이지 작업
##### ◻ 2020년 12월 ~ 2021년 2월

![App Screenshot](project_img/1/6.png)

* 제 첫 임무는 학부 내 신규 전공인 인공지능전공 홈페이지를 제작하는 것이었습니다. 
하지만, 이때 당시 2학년이었던 저로서는 부족한 실력을 가지고 있었고, 
나머지 팀원들도 마찬가지로 코드 파악에만 시간을 보내게 되었습니다. 
* 이때 고육지책의 일환으로 기존 프로젝트를 유지하되, 
url에 따른 테마 변경이 가능할 것이라는 다소 황당한 아이디어를 제시하게 됐고, 
이를 실제로 구현하여 한 개의 프로젝트가 마치 두 개의 프로젝트인 것처럼 보일 수 있도록 하는 작업을 진행했습니다. 
처음에는 이런 아이디어가 굉장히 쉽게 해결할 수 있는 일이라고 생각했었으나, 
학과 홈페이지가 학교로부터 url을 할당받는 과정부터 시작해서, 
처음 다뤄보는 리눅스 운영체제까지 여러 문제가 발생하였습니다. 
* 결국 할당받은 url을 학과 내 서버 컴퓨터에서 처리하는 방법에 대해 공부하게 되었고, 
이때의 환경 설정 경험이 이후에 진행하게 될 프로젝트들에게 많은 영향을 미치게 됩니다. 

* 또, 당시 2학년인 상황에서 기술에 대해 전혀 학습이 없는 
(심지어 웹에 대해서 아는 것이 전혀 없는)상태로 프로젝트에 참여하였고, 
얼떨결에 맡은 팀장직에 대한 부담감과 무조건 프로젝트를 완수한다는 마음으로 겨울 방학 내내 
이 프로젝트에 사용된 코드와 기술들을 학습하는 시간을 가지게 되었습니다. 
* 결국 프로젝트를 간단히 해결하려다가 예상치 못한 상황들로 인해 JSP가 어떻게 돌아가는지, 
웹이란 무엇인지에 대해 어깨너머로 배울 수 있는 계기가 됐습니다.


### ■ 컴퓨터공학부 홈페이지 사물함 신청 서비스 작업
##### ◻ 2021년 3월 ~ 6월

![App Screenshot](project_img/1/7.png)

* 겨울 방학에 저와 함께했던 팀원들은 개인 사정으로 모두 팀을 떠나게 됐고, 
프로젝트는 끝이 나게 됐습니다. 
* 하지만 저는 이때까지 학습한 것이 너무 아쉽다는 생각이 들어 프로젝트를 계속 이어 나갈 것을 
담당 교수님께 건의드렸고, 새로운 팀원들을 직접 모으기 시작하여 학과 홈페이지를 
다시 살릴 것을 계획했습니다. 

* 이 프로젝트에서 알게 된 팀원들에게 그동안 제가 학습했던 모든 내용들을 공유하고 전수하는 것에 집중하는 
시기였는데, 연습삼아 학과 내 사물함 신청 서비스 기능을 추가하기로 했습니다. 

* 학과 내 학생들이 사물함을 배정받을 때, 페이스북 댓글로 신청하고 보증금을 수기로 작성하는 등 
여러 가지 문제가 있다고 생각하여 이 프로젝트를 진행하였고, 이 주제로 교내 공모전인 2021-1 BARUN 문제해결프로젝트에 참가하여 우수상을 수상하기도 
했습니다. 

* 이때 처음으로 개발을 계획적으로, 심도있게 진행할 수 있는 계기가 되었고 새로 모집한 팀원들과 
함께 성장할 수 있는 계기가 됐습니다.

### ■ 컴퓨터공학부 홈페이지 졸업요건진단시스템 작업
##### ◻ 2021년 9월 ~ 12월


![App Screenshot](project_img/1/9.png)

![App Screenshot](project_img/1/10.png)

* 교내에서 학과 홈페이지를 가장 많이 사용하는 사람들은 사무실에서 근무하는 조교들입니다. 
* 주요 사용자인 조교들과 대화하다 알게 된 점은, 이들이 해마다 졸업 예정자들로부터 졸업요건에 
충족하는지 확인해달라는 전화를 폭발적으로 받는다는 것이었습니다. 
* 해마다 바뀌는 졸업요건으로 인해 조교들도 굉장히 혼란스럽고 학생들도 혼란스럽기는 
마찬가지였습니다. 

* 저는 명색이 컴퓨터공학부인데 교내 홈페이지에 이런 시스템 하나쯤은 있어야 한다고 생각하였고, 
이를 실제로 구현에 옮기기로 했습니다. 
* 학번별로 다른 졸업요건을 가지고 있다는 것과 해마다 조건이 바뀔 수 있다는 점, 
그리고 학생과 조교 모두 쓰기 편한 형태여야한다는 점 등을 고려해야 했는데 제가 이때까지 
진행했던 모든 프로젝트를 통틀어서 가장 힘들고 고된 작업 중 하나였습니다. 

* 안그래도 복잡한 요건 계산(총학점, 전공학점, 교양학점, 공학인증, 필수과목이수, 사라지는 필수 교과목 등)은 둘째치고 jQuery와 바닐라JS로는 이런 복잡한 기능을 구현하기가 심각하게 어려웠습니다. 
* 아주 복잡하지만 나름 잘 정리해가면서 수많은 시도 끝에 정상적으로 동작하는 졸업요건 계산 서비스를 구현하게 됐습니다. 

* 하지만 저는 이때 그동안 해온 웹 학습(JSP, jQuery 등)에 대해서 굉장한 회의감을 느끼고 jQuery가 왜 더 이상 인기가 없는지에 대해서 뼈저리게 느끼게 된 계기가 됐습니다. 
* 곧 4학년이 될 제가 더 이상 이 기술들로부터 무엇을 얻을 수 있는지에 대해 깊은 고민 끝에 함께하던 팀원들과 다 같이 학과홈페이지 관리팀을 그만두는 것을 결정하였고, 
해당 프로젝트는 후배들에게 인수인계를 확실하게 하여 넘어가게 됐습니다. 

* 여담이지만 이때 만든 졸업요건진단 시스템도 교내 경진대회인 바른문제해결프로젝트에 출전하여 장려상을 수상했습니다.


`;
export default long_description;